lst_weather=["周一","16℃","26℃","多云","1级","优"],
["周二","17℃","27℃","晴","2级","优"],
["周三","16℃" ,"28℃","晴","3级","优"],
["周四","16℃" ,"25℃","阴","2级","良"],
["周五","15℃" ,"24℃","阴","2级","良"],
["周六","15℃","25℃","晴","3级","优"],
["周日","14℃","23℃","小雨","3级","良"]
num1 = [x[0] for x in lst_weather  if x[4]== "优"]
num2 = [x[0] for x in lst_weather  if (x[4]<"3") and (x[2] <= "25") ]
num3 = [x[0] for x in lst_weather  if (int(x[1])+int(x[2]))/2 < 20]
print("空气质量为优的天数:{}\n".format(len(num1)))
#print("风力低于3级且最高气温不超过25℃的天数:{}\n".format(len(num2))
#print("平均天气低于20度的天数有:{}\n".format(len(num3))
